


text1 = '''
Истоки регулярных выражений лежат в теории автоматов, теории формальных языков и классификации
формальных грамматик по Хомскому[3]. Эти области изучают вычислительные модели (автоматы) и способы описания и
классификации формальных языков. В 1940-х гг. Уоррен Маккалок и Уолтер Питтс описали нейронную систему,
используя простой автомат в качестве модели нейрона. Математик Стивен Клини позже описал эти модели, используя
свою систему математических обозначений, названную «регулярные множества». Кен Томпсон встроил их в редактор QED,
а затем в редактор ed под UNIX. С этого времени регулярные выражения стали широко использоваться в
UNIX и UNIX-подобных утилитах, например в expr, awk, Emacs, vi, lex и Perl.
'''

text2 = '''ёжики
Это вступление из статьи о форматах дат в английской википедии&
В ней почему-то рассказывается про то, какие форматы использовали писателиКОНЕЦ_СТРОКИ
Writers have traditionally written abbreviated dates according to their local custom, 
creating all-numeric equivalents to day–month formats such as "23 March 2021" (23/03/21, 23/03/2021, 
23-03-2021 or 23.03.2021) and month–day formats such as "March 23, 2021" (03/23/21 or 03/23/2021). 
This can result in dates that are impossible to understand correctly without knowing 
the writer's origin and/or other contextual details, as dates such as "10/11/06" 
can be interpreted as "10 November 2006" in the DMY format, "October 11, 2006" in MDY, 
and "2010 November 6" in YMD. The ISO 8601 format YYYY-MM-DD (2021-03-22 [refresh]) is intended to harmonize 
these formats and ensure accuracy in all situations. Many countries have adopted it as their 
sole official date format, though even in these areas writers may adopt abbreviated formats 
that are no longer recommended.
'''

text3 = '''
На другой день я проснулся с головною болью, смутно припоминая себе вчерашние происшествия. Размышления мои прерваны были Савельичем, вошедшим ко мне с чашкою чая. Рано, Петр Андреич, — сказал он мне, качая головою, — рано начинаешь гулять. И в кого ты пошел? Кажется, ни батюшка, ни дедушка пьяницами не бывали; о матушке и говорить нечего: отроду, кроме квасу, в рот ничего не изволили брать. А кто всему виноват? проклятый мусье. То и дело, бывало, к Антипьевне забежит: Мадам, же ву при, водкю. Вот тебе и же ву при! Нечего сказать: добру наставил, собачий сын. И нужно было нанимать в дядьки басурмана, как будто у барина не стало и своих людей! 
'''


text4 = '''Несмотря на то, что НЛО наблюдаются повсеместно, существуют районы, 
где их наблюдают особенно часто — так называемые «окна». Понятие о них ввёл французский уфолог Эме Мишель. 
Подобные «окна» имеются в Соединённых Штатах Америки (Техас, Флорида, северо-запад тихоокеанского побережья, 
долина Гудзона), в Австралии (Кэрнс в Квинсленде, Кемпси в Новом Южном Уэльсе, равнина Налларбор, 
Бассов пролив), Японии (Хоккайдо), Франции, Великобритании (Лотиан, залив Лус (Шотландия), Дайред (Уэльс), 
Пеннинские горы и Уорминстер (Уилтшир)) и в Бразилии, Аргентине, Италии, Испании, Норвегии, Малайзии, в 
Пуэрто-Рико и на Канарских островах (в Африке «окон» не зафиксировано).
Нет единого мнения об «окнах». Некоторые исследователи склонны рассматривать в качестве 
причины «волн» сообщений о НЛО повышенную яркость того или иного астрономического объекта 
в данный период — например, Марса. Есть мнения о том, что «волны» таких сообщений возникают 
в государствах, переживающих те или иные трудности (к примеру, всплеск сообщений о «летающих тарелках» 
в конце 1940-х годов некоторые объясняют холодной войной). Некоторые считают, что увлечение 
населения новыми научно-фантастическими произведениями (например, кинофильмами) стимулируют 
появление рассказов о наблюдении НЛО.
'''


text5 = 'Лев Николаевич Толстой (1828 - 1910) - классик, автор «Войны и мира» и «Анны Карениной». Алексей Константинович Толстой (1817 - 1875) - автор «Князя Серебряного». Алексей Николаевич Толстой (1883 - 1945) - тоже граф, автор «Аэлиты» и «Гиперболоида инженера Гарина». Сергей Николаевич Толстой (1908-1977) - поэт и публицист.'