# Задание №3
shows = {'Секретные материалы': 'фантастика', 'Ведьмак': 'фэнтази', 'Клан Сопрано': 'криминал', '24': 'драма', 'Черное зеркало': 'фантастика', 'Во все тяжкие': 'криминал', 'Игра престолов': 'фэнтази',
'Карточный домик': 'драма', 'Рик и Морти': 'фантастика'}

shows2 = {key: value for key, value in shows.items() if value in ('фантастика','фэнтази')}
print(shows2)

shows3 = [x for x in shows2.keys()]
print(shows3)